ab_cs_test_result_get
ab -k -n 100000 -c 1000 http://localhost:4000/product > ~/ab_cs_test_result_get
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /product
Document Length:        146 bytes

Concurrency Level:      1000
Time taken for tests:   10.682 seconds
Complete requests:      100000
Failed requests:        0
Non-2xx responses:      100000
Keep-Alive requests:    100000
Total transferred:      41800000 bytes
HTML transferred:       14600000 bytes
Requests per second:    9361.67 [#/sec] (mean)
Time per request:       106.819 [ms] (mean)
Time per request:       0.107 [ms] (mean, across all concurrent requests)
Transfer rate:          3821.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.6      0      21
Processing:    24  106  10.4    103     175
Waiting:        4  106  10.4    103     175
Total:         24  106  10.6    103     185

Percentage of the requests served within a certain time (ms)
  50%    103
  66%    106
  75%    109
  80%    111
  90%    119
  95%    127
  98%    141
  99%    150
 100%    185 (longest request)